In [1]:
import pandas as pd

# csv, excel, website, DB, JSON, API, CRM, Software, PDF, Doc

In [10]:
# initialize list elements
values = [10,20,30,40,50,60]
 
# Create the pandas DataFrame with column name is provided explicitly
df = pd.DataFrame(data=values, columns=['Numbers'])
 
# print dataframe.
df

   Numbers
0       10
1       20
2       30
3       40
4       50
5       60

In [17]:
subjects = ["Mathematics","Chemistry","Physics","History","Geography","German"]
classes = pd.Series(subjects)
#print(subjects)
#print(type(classes))
grades  = pd.Series([90,54,77,22,25])

pd.DataFrame(data={"Classes": classes[1:], "Grades": grades[1:]})

     Classes  Grades
1  Chemistry    54.0
2    Physics    77.0
3    History    22.0
4  Geography    25.0
5     German     NaN

In [25]:
index1 = ["first", "second", "third"]
subjects = pd.Series(["Mathematics","Chemistry","Physics"])
grades = pd.Series([90,54,77])
pd.DataFrame(data={"Classes": subjects, "Grades": grades}, index = index1) ## Does not work with index

       Classes  Grades
first      NaN     NaN
second     NaN     NaN
third      NaN     NaN

In [24]:
subjects

0    Mathematics
1      Chemistry
2        Physics
dtype: object

In [16]:
index_values = ["first", "second", "third", "fourth", "five"]
a = {'ID':[1,2,3,4,5],
  'Name':["Jai","Veeru","Basanti","Gabbar","Thakur"],
  'Age': [32,31,24,45,62]}

sholay = pd.DataFrame(data = a, index =index_values)
sholay

        ID     Name  Age
first    1      Jai   32
second   2    Veeru   31
third    3  Basanti   24
fourth   4   Gabbar   45
five     5   Thakur   62

In [26]:
data_values = [['Karan',23],['Rohit',22],['Sahil',21],['Aryan',24]]

df = pd.DataFrame(data = data_values, columns = ['Name','Age'])
df

    Name  Age
0  Karan   23
1  Rohit   22
2  Sahil   21
3  Aryan   24

In [28]:
# Initialize data to lists.
data_values = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30, 'd': 67}]
 
# Creates DataFrame.
df = pd.DataFrame(data_values)
 
# Print the data
df

    a   b   c     d
0   1   2   3   NaN
1  10  20  30  67.0

In [29]:
# Initialize data of lists
data = [{'b': 2, 'c': 3}, {'a': 10, 'b': 20, 'c': 30}]
 
# Creates pandas DataFrame by passing
# Lists of dictionaries and row index.
df = pd.DataFrame(data, index=['first', 'second'])
 
# Print the data
df

         b   c     a
first    2   3   NaN
second  20  30  10.0

In [30]:
# Initialize lists data.
data = [{'a': 1, 'b': 2},
        {'a': 5, 'b': 10, 'c': 20}]
 
# With two column indices, values same
# as dictionary keys
df1 = pd.DataFrame(data, index=['first',
                                'second'],
                   columns=['a', 'b'])
 
# With two column indices with
# one index with other name
df2 = pd.DataFrame(data, index=['first',
                                'second'],
                   columns=['a', 'b1'])
 
# print for first data frame
print(df1, "\n")
 
# Print for second DataFrame.
print(df2)

        a   b
first   1   2
second  5  10

        a  b1
first   1 NaN
second  5 NaN

In [34]:
# Initialize data to Dicts of series.
one = [10, 20, 30, 40]
oneSeries = pd.Series(one, index=['a', 'c', 'b', 'd'])
d = {'one': oneSeries,
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}
 
# creates Dataframe.
df = pd.DataFrame(d)
 
# print the data.
df

   one  two
a   10   10
b   30   20
c   20   30
d   40   40